Управление_торговлей_демо_115.РабочийСтол1С/src/Catalogs/РБ_ВариантыНастроекРабочегоСтола/РБ_ВариантыНастроекРабочегоСтола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РБ_ВариантыНастроекРабочегоСтола</name>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей_демо_115.РабочийСтол1С/src/Catalogs/РБ_ВариантыНастроекРабочегоСтола/ManagerModule.bsl
// Вариант настройки.
// 
// Параметры:
//  СсылкаВарианта - СправочникСсылка.РБ_ВариантыНастроекРабочегоСтола - Ссылка варианта
//  НаименованиеНастройки - Строка - Наименование настройки
//  ХранилищеНастроек - ХранилищеЗначения - Хранилище настроек
//  Автор - СправочникСсылка.Пользователи - Автор
// 
// Возвращаемое значение:
//  СправочникСсылка.РБ_ВариантыНастроекРабочегоСтола - Вариант настройки
Функция ВариантНастройки(СсылкаВарианта,НаименованиеНастройки,ХранилищеНастроек,Автор) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаВарианта) Тогда
		ОбъектВарианта = Справочники.РБ_ВариантыНастроекРабочегоСтола.СоздатьЭлемент();
	Иначе
		ОбъектВарианта = СсылкаВарианта.ПолучитьОбъект();
	КонецЕсли;
	
	ОбъектВарианта.Наименование = НаименованиеНастройки;
	ОбъектВарианта.Настройка    = ХранилищеНастроек;
	ОбъектВарианта.Автор        = Автор;
	ОбъектВарианта.Записать();
	Возврат ОбъектВарианта.Ссылка;
КонецФункции
